In [1]:
import pandas as pd

In [7]:
fruits = pd.Series(['Apple', 'Banana', 'Cherry', 'Orange', 'Pear'], name = "Fruit")
fruits

0     Apple
1    Banana
2    Cherry
3    Orange
4      Pear
Name: Fruit, dtype: object

In [8]:
qtys = pd.Series([5,7,2,9,4])
qtys

0    5
1    7
2    2
3    9
4    4
dtype: int64

In [13]:
inv = pd.DataFrame( { 'Fruit' : fruits, 'Quantity': qtys, 'Price' : [2.99,1.99,3.99,2.99,1.49] })
inv

    Fruit  Quantity  Price
0   Apple         5   2.99
1  Banana         7   1.99
2  Cherry         2   3.99
3  Orange         9   2.99
4    Pear         4   1.49

In [20]:
from IPython.display import display

display(inv)
display(inv)

    Fruit  Quantity  Price
0   Apple         5   2.99
1  Banana         7   1.99
2  Cherry         2   3.99
3  Orange         9   2.99
4    Pear         4   1.49

    Fruit  Quantity  Price
0   Apple         5   2.99
1  Banana         7   1.99
2  Cherry         2   3.99
3  Orange         9   2.99
4    Pear         4   1.49

In [26]:
inv.iloc[1:2, 1:]

   Quantity  Price
1         7   1.99

In [29]:
inv.iloc[2:,0:1]

    Fruit
2  Cherry
3  Orange
4    Pear

In [33]:
inv.iloc[2:4]

    Fruit  Quantity  Price
2  Cherry         2   3.99
3  Orange         9   2.99

In [35]:
inv[ ['Fruit', 'Price'] ]

    Fruit  Price
0   Apple   2.99
1  Banana   1.99
2  Cherry   3.99
3  Orange   2.99
4    Pear   1.49

In [38]:
inv[ ['Price'] ]

   Price
0   2.99
1   1.99
2   3.99
3   2.99
4   1.49

In [40]:
inv['Price']

0    2.99
1    1.99
2    3.99
3    2.99
4    1.49
Name: Price, dtype: float64

In [41]:
inv

    Fruit  Quantity  Price
0   Apple         5   2.99
1  Banana         7   1.99
2  Cherry         2   3.99
3  Orange         9   2.99
4    Pear         4   1.49

In [43]:
inv['Quantity'] > 5

0    False
1     True
2    False
3     True
4    False
Name: Quantity, dtype: bool

In [44]:
inv[ inv['Quantity'] > 5 ]

    Fruit  Quantity  Price
1  Banana         7   1.99
3  Orange         9   2.99

In [45]:
fruit = input("Enter a fruit: ")
display(inv[ inv['Fruit'] == fruit ])

Enter a fruit: Orange

    Fruit  Quantity  Price
3  Orange         9   2.99

In [46]:
while True:
    fruit = input("Enter a fruit: ")

    if fruit == 'quit': 
        break
    
    display(inv[ inv['Fruit'] == fruit ])

Enter a fruit: cheese

Empty DataFrame
Columns: [Fruit, Quantity, Price]
Index: []

Enter a fruit: Apple

   Fruit  Quantity  Price
0  Apple         5   2.99

Enter a fruit: Cherry

    Fruit  Quantity  Price
2  Cherry         2   3.99

Enter a fruit: quit